Revit 2027 API
SpatialFieldManager.SetMeasurementNames Method
 Sets Names for all measurements
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMeasurementNames(
	IList<string> measurementNames
)
Public Sub SetMeasurementNames (
	measurementNames As IList(Of String)
)
public:
void SetMeasurementNames(
	IList<String^>^ measurementNames
)
member SetMeasurementNames :
        measurementNames : IList<string> -> unit
Parameters
measurementNames IList<String>
 Array of measurement names. All names in the array must be unique. The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.
Exceptions
Exception | Condition
ArgumentException |  measurementNames contains duplicate names or its lengths is not equal to the number of measurements set during creation of SpatialFieldManager
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace